app/Models/FavouriteModel.php

SELECT `favourite`.*, `users`.`name` as `user_name`, `users`.`email`, `food`.`nama` as `food_name`, `food`.`jenis`, `food`.`images`
FROM `favourite`
JOIN `users` ON `users`.`user_id` = `favourite`.`user_id`
JOIN `food` ON `food`.`food_id` = `favourite`.`food_id`
WHERE `favourite`.`user_id` = '2'
---
    public function getByUserId($userId)
    {
        return $this->select('favourite.*, users.name as user_name, users.email, food.nama as food_name, food.jenis, food.images')
                    ->join('users', 'users.user_id = favourite.user_id')
                    ->join('food', 'food.food_id = favourite.food_id')
                    ->where('favourite.user_id', $userId)
                    ->findAll();