app/Models/FoodDetailModel.php

    public function getByFoodId($foodId)
    {
        // Membangun query dengan builder
        $builder = $this->db->table('food'); // Memulai query pada tabel food
        $builder->select('food.*, food_detail.*'); // Memilih semua kolom dari food dan food_detail
        $builder->join('food_detail', 'food.food_id = food_detail.food_id', 'left'); // Menggunakan LEFT JOIN
        $builder->where('food.food_id', $foodId); // Menetapkan kondisi where untuk food.food_id

        // Menjalankan query dan mendapatkan hasilnya
        $result = $builder->get()->getResult();
---
SELECT `food_detail`.*, `food`.`jenis`, `food`.`nama`, `food`.`kesulitan`, `food`.`images`
FROM `food_detail`
LEFT JOIN `food` ON `food`.`food_id` = `food_detail`.`food_id`
WHERE `food`.`food_id` = 2
SELECT `food`.*, `food_detail`.*
FROM `food`
LEFT JOIN `food_detail` ON `food`.`food_id` = `food_detail`.`food_id`
WHERE `food`.`food_id` = '3'