app/Models/UserModel.php

    public function login($code, $password)
    {
        $user = $this->asArray()
                     ->where(['code' => $code])
                     ->first();
---
SELECT *
FROM `users`
WHERE `code` = 'admin'
 LIMIT 1